/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "Réessayer";
CancelButtonTitle = "Annuler";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> car la lecture du fichier suivant a échoué : \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> parce que le fichier suivant est introuvable : “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Remplacez le fichier \"HPEventStore.hpstore\" si vous l'avez déplacé ou supprimé, puis cliquez sur \"Réessayer\".\rPour créer un nouveau fichier, cliquez sur \"Créer\".";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Créer";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> parce que l'application ne peut pas accéder au fichier suivant : “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Réparer l'accès";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Vérifiez les dossiers contenant le fichier \"HPEventStore.hpstore\" pour vous assurer qu'ils ne sont pas verrouillés et que leurs autorisations sont définies sur \"Lecture et écriture\", puis cliquez sur \"Réessayer\".\rPour que l'application tente de réparer les autorisations, cliquez sur \"Réparer l'accès\".";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> car l'espace est insuffisant sur le disque de démarrage.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Supprimez quelques fichiers sur le disque, puis cliquez sur \"Réessayer\".";
